       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEREAD. *> CZYTANIE PLIKU SEKWENCYJNEGO

       ENVIRONMENT DIVISION.

       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
            SELECT MYFILE *> NAZWA PLIKU W PROGRAMIE
            ASSIGN TO "F:\gnuCobol\IMDBlist.txt"
            ORGANIZATION IS LINE SEQUENTIAL
            ACCESS MODE IS SEQUENTIAL
            FILE STATUS IS ERR.

       DATA DIVISION.
       FILE SECTION.
       FD MYFILE.
       01 MYFILE-RECORDS PICTURE X(219).

       WORKING-STORAGE SECTION.
       01 WS-RECORD PICTURE X(219).

       01 END-OF-FILE PIC A(3) VALUE 'NO'.

       01 ERR PICTURE X(2).

       PROCEDURE DIVISION.

           OPEN INPUT MYFILE.
           DISPLAY 'OPEINGIN FILE STATUS IS ' ERR

           PERFORM UNTIL END-OF-FILE = 'YES' *> 3 TIMES DLA TRZECH OTWORZEN ITP.
           READ MYFILE
            INTO WS-RECORD
            AT END
                MOVE 'YES' TO END-OF-FILE
                DISPLAY 'FILE ENDED HERE FILE STATUS ' ERR
            NOT AT END
                DISPLAY WS-RECORD
           END-READ
           END-PERFORM.

           CLOSE MYFILE.
           DISPLAY 'CLOASING FILE STATUS IS ' ERR.

           STOP RUN.
